lixc929/hardware/firmware/ch585_spi_slave_test/src/main.c
/*
 * Minimal CH585M SPI0 slave key-state source for the H417 SPI bring-up.
 *
 * Wiring expected by the current H417 test firmware:
 *   CH585 PA12 / SPI0 CS   <- H417 PB12 / SPI2 NSS
 *   CH585 PA13 / SPI0 SCK  <- H417 PB13 / SPI2 SCK
 *   CH585 PA14 / SPI0 MOSI <- H417 PC1  / SPI2 MOSI
 *   CH585 PA15 / SPI0 MISO -> H417 PC2  / SPI2 MISO
 */

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "CH58x_common.h"

#define CH585_SCAN_FRAME_MAGIC       0x4BD3U
#define CH585_SCAN_FRAME_VERSION     2U
#define CH585_SCAN_FRAME_TYPE_KEY_STATE 0x10U
#define CH585_SCAN_CMD_MAGIC         0x524BU
#define CH585_SCAN_CMD_GET_STATE     0x01U
#define CH585_SCAN_CMD_GET_DEBUG     0x02U
#define CH585_SCAN_CMD_GET_CONFIG    0x03U
#define CH585_SCAN_CMD_SET_CONFIG    0x04U
#define CH585_SCAN_CMD_CALIBRATE_KEY 0x05U
#define CH585_SCAN_CMD_CALIBRATE_ALL 0x06U
#define CH585_SCAN_SHORT_FRAME_MAGIC 0xD7U
#define CH585_SCAN_SHORT_FRAME_TYPE_KEY_STATE 0x11U
#define CH585_SCAN_SHORT_FRAME_TYPE_KEY_DEBUG 0x12U
#define CH585_SCAN_SHORT_CMD_MAGIC   0xA7U
#define CH585_SCAN_SOURCE_ID         0U
#define CH585_SCAN_KEYS_PER_SOURCE   64U
#define CH585_SCAN_DOWN_BYTES        (CH585_SCAN_KEYS_PER_SOURCE / 8U)
#define CH585_SCAN_FLAG_READY        (1U << 15)
#define CH585_SCAN_FLAG_CMD_ERROR    (1U << 4)
#define CH585_SCAN_SHORT_FLAG_READY  (1U << 7)
#define CH585_SCAN_SHORT_FLAG_CMD_ERROR (1U << 4)
#define CH585_SCAN_SHORT_DEBUG_FLAG_DOWN     (1U << 0)
#define CH585_SCAN_SHORT_DEBUG_FLAG_RT_ARMED (1U << 1)
#define CH585_SCAN_REQ0              'K'
#define CH585_SCAN_REQ1              'R'
#define CH585_SCAN_CFG_RELEASED_ADC       0x01U
#define CH585_SCAN_CFG_PRESSED_ADC        0x02U
#define CH585_SCAN_CFG_MIN_ADC            0x03U
#define CH585_SCAN_CFG_MAX_ADC            0x04U
#define CH585_SCAN_CFG_PRESS_POSITION     0x05U
#define CH585_SCAN_CFG_RELEASE_POSITION   0x06U
#define CH585_SCAN_CFG_RT_PRESS_DELTA     0x07U
#define CH585_SCAN_CFG_RT_RELEASE_DELTA   0x08U
#define CH585_SCAN_CFG_FILTER_SHIFT       0x09U
#define CH585_SCAN_CFG_RT_ENABLE          0x0AU
#define CH585_SCAN_CFG_VALID              0x0BU
#define CH585_SCAN_CFG_GLOBAL_KEY_ID      0x0CU
#define CH585_SIM_RELEASED_ADC       1000U
#define CH585_SIM_PRESSED_ADC        3000U
#define CH585_KEY_DEFAULT_MIN_ADC    0U
#define CH585_KEY_DEFAULT_MAX_ADC    4095U
#define CH585_KEY_DEFAULT_FILTER_SHIFT 2U
#define CH585_KEY_DEFAULT_PRESS_POSITION_PM 500U
#define CH585_KEY_DEFAULT_RELEASE_POSITION_PM 350U
#define CH585_KEY_DEFAULT_RT_PRESS_DELTA_PM 80U
#define CH585_KEY_DEFAULT_RT_RELEASE_DELTA_PM 80U
#define CH585_KEY_INVALID_GLOBAL_ID  0xFFFFU
#define CH585_SIM_ACTIVE_KEYS        4U
#define CH585_SIM_PERIOD_FRAMES      32U

#ifndef CH585_DEBUG_FRAME_INTERVAL
#define CH585_DEBUG_FRAME_INTERVAL   8U
#endif

#ifndef CH585_LINK_TEST_MISO_LOW
#define CH585_LINK_TEST_MISO_LOW     0
#endif

#ifndef CH585_LINK_TEST_SPI_PATTERN
#define CH585_LINK_TEST_SPI_PATTERN  0
#endif

#ifndef CH585_SPI0_MISO_STRONG_DRIVE
#define CH585_SPI0_MISO_STRONG_DRIVE 0
#endif

#ifndef CH585_FAST_SIM_FRAME
#define CH585_FAST_SIM_FRAME       0
#endif

#ifndef CH585_KEY_ENABLE_RAPID_TRIGGER
#define CH585_KEY_ENABLE_RAPID_TRIGGER 1
#endif

#ifndef CH585_STATIC_FRAME_TEST
#define CH585_STATIC_FRAME_TEST    0
#endif

#ifndef CH585_USE_SPI0_SLAVE_DMA
#define CH585_USE_SPI0_SLAVE_DMA     1
#endif

#ifndef CH585_USE_SHORT_FRAME
#define CH585_USE_SHORT_FRAME        1
#endif

#ifndef CH585_USE_PIPELINE_SHORT
#define CH585_USE_PIPELINE_SHORT     0
#endif

#ifndef CH585_USE_REQUEST_ONLY_SHORT
#define CH585_USE_REQUEST_ONLY_SHORT CH585_USE_SHORT_FRAME
#endif

#define CH585_MODE_PIPELINE_SHORT \
    (CH585_USE_PIPELINE_SHORT && CH585_USE_SHORT_FRAME)
#define CH585_MODE_REQUEST_ONLY_SHORT \
    (CH585_USE_REQUEST_ONLY_SHORT && CH585_USE_SHORT_FRAME)
#define CH585_MODE_COMMAND_RESPONSE \
    (!CH585_MODE_PIPELINE_SHORT && !CH585_MODE_REQUEST_ONLY_SHORT)

typedef struct __attribute__((packed))
{
    uint16_t magic;
    uint8_t version;
    uint8_t type;
    uint8_t source_id;
    uint8_t key_count;
    uint16_t seq;
    uint16_t flags;
    uint16_t ack_seq;
    uint8_t down_bits[CH585_SCAN_DOWN_BYTES];
    uint16_t diag;
    uint16_t crc16;
} ch585_scan_frame_v2_t;

typedef struct __attribute__((packed))
{
    uint16_t magic;
    uint8_t version;
    uint8_t cmd;
    uint16_t host_seq;
    uint16_t ack_seq;
    uint16_t flags;
    uint16_t crc16;
} ch585_scan_cmd_legacy_t;

typedef struct __attribute__((packed))
{
    uint8_t magic;
    uint8_t type;
    uint8_t source_id;
    uint8_t seq;
    uint8_t ack_seq;
    uint8_t flags;
    uint8_t down_bits[CH585_SCAN_DOWN_BYTES];
    uint16_t crc16;
} ch585_scan_frame_short_t;

typedef struct __attribute__((packed))
{
    uint8_t magic;
    uint8_t type;
    uint8_t source_id;
    uint8_t seq;
    uint8_t key_id;
    uint8_t flags;
    uint16_t raw_adc;
    uint16_t filtered_adc;
    uint16_t position_pm;
    uint16_t peak_pm;
    uint16_t crc16;
} ch585_scan_debug_short_t;

typedef struct __attribute__((packed))
{
    uint8_t magic;
    uint8_t cmd;
    uint8_t host_seq;
    uint8_t ack_seq;
    uint8_t target_key;
    uint8_t param_id;
    uint16_t value;
    uint16_t flags;
    uint16_t aux;
    uint8_t reserved[2];
    uint16_t crc16;
} ch585_scan_cmd_short_t;

#if CH585_USE_SHORT_FRAME
typedef ch585_scan_frame_short_t ch585_scan_wire_frame_t;
typedef ch585_scan_cmd_short_t ch585_scan_wire_cmd_t;
#else
typedef ch585_scan_frame_v2_t ch585_scan_wire_frame_t;
typedef ch585_scan_cmd_legacy_t ch585_scan_wire_cmd_t;
#endif

typedef struct
{
    uint16_t released_adc;
    uint16_t pressed_adc;
    uint16_t min_adc;
    uint16_t max_adc;
    uint16_t press_position_pm;
    uint16_t release_position_pm;
    uint16_t rt_press_delta_pm;
    uint16_t rt_release_delta_pm;
    uint16_t global_key_id;
    uint8_t filter_shift;
    uint8_t rt_enable;
    uint8_t valid;
} ch585_key_config_t;

#if CH585_MODE_PIPELINE_SHORT || CH585_MODE_COMMAND_RESPONSE
static __attribute__((aligned(4))) ch585_scan_wire_frame_t g_frame;
#endif
static __attribute__((aligned(4))) ch585_scan_wire_frame_t g_frame_pingpong[2];
#if CH585_MODE_PIPELINE_SHORT || CH585_MODE_COMMAND_RESPONSE
static __attribute__((aligned(4))) ch585_scan_wire_cmd_t g_cmd;
#endif
#if CH585_MODE_PIPELINE_SHORT
static __attribute__((aligned(4))) uint8_t g_pipe_rx[sizeof(ch585_scan_wire_frame_t)];
#endif
static ch585_key_config_t g_key_config[CH585_SCAN_KEYS_PER_SOURCE];
static uint8_t g_key_down[CH585_SCAN_KEYS_PER_SOURCE];
static uint8_t g_key_filter_valid[CH585_SCAN_KEYS_PER_SOURCE];
static uint8_t g_key_rt_armed[CH585_SCAN_KEYS_PER_SOURCE];
static uint16_t g_key_raw_adc[CH585_SCAN_KEYS_PER_SOURCE];
static uint16_t g_key_filtered_adc[CH585_SCAN_KEYS_PER_SOURCE];
static uint32_t g_key_filtered_q8[CH585_SCAN_KEYS_PER_SOURCE];
static uint16_t g_key_position_pm[CH585_SCAN_KEYS_PER_SOURCE];
static uint16_t g_key_peak_pm[CH585_SCAN_KEYS_PER_SOURCE];
static uint16_t g_key_valley_pm[CH585_SCAN_KEYS_PER_SOURCE];

static uint16_t scan_crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU;
    uint16_t i;
    uint8_t bit;

    for (i = 0; i < len; i++)
    {
        crc ^= (uint16_t)data[i] << 8;
        for (bit = 0; bit < 8; bit++)
        {
            if ((crc & 0x8000U) != 0U)
            {
                crc = (uint16_t)((crc << 1) ^ 0x1021U);
            }
            else
            {
                crc = (uint16_t)(crc << 1);
            }
        }
    }

