lixc929/hardware/firmware/ch585_spi_slave_test/src/main.c
    return crc;
}

static void key_config_init_defaults(void)
{
    uint8_t i;

    for (i = 0; i < CH585_SCAN_KEYS_PER_SOURCE; i++)
    {
        ch585_key_config_t *cfg = &g_key_config[i];

        cfg->released_adc = CH585_SIM_RELEASED_ADC;
        cfg->pressed_adc = CH585_SIM_PRESSED_ADC;
        cfg->min_adc = CH585_KEY_DEFAULT_MIN_ADC;
        cfg->max_adc = CH585_KEY_DEFAULT_MAX_ADC;
        cfg->press_position_pm = CH585_KEY_DEFAULT_PRESS_POSITION_PM;
        cfg->release_position_pm = CH585_KEY_DEFAULT_RELEASE_POSITION_PM;
        cfg->rt_press_delta_pm = CH585_KEY_DEFAULT_RT_PRESS_DELTA_PM;
        cfg->rt_release_delta_pm = CH585_KEY_DEFAULT_RT_RELEASE_DELTA_PM;
        cfg->global_key_id = (uint16_t)i;
        cfg->filter_shift = CH585_KEY_DEFAULT_FILTER_SHIFT;
#if CH585_KEY_ENABLE_RAPID_TRIGGER
        cfg->rt_enable = 1U;
#else
        cfg->rt_enable = 0U;
#endif
        cfg->valid = 1U;

        g_key_raw_adc[i] = cfg->released_adc;
        g_key_filtered_adc[i] = cfg->released_adc;
        g_key_filtered_q8[i] = (uint32_t)cfg->released_adc << 8;
        g_key_position_pm[i] = 0U;
        g_key_peak_pm[i] = 0U;
        g_key_valley_pm[i] = 0U;
    }
}

static const ch585_key_config_t *key_config(uint8_t key_id)
{
    if (key_id >= CH585_SCAN_KEYS_PER_SOURCE)
    {
        return &g_key_config[0];
    }

    return &g_key_config[key_id];
}

#if CH585_MODE_PIPELINE_SHORT || CH585_MODE_COMMAND_RESPONSE
static void key_runtime_reset(uint8_t key_id)
{
    const ch585_key_config_t *cfg = key_config(key_id);

    if (key_id >= CH585_SCAN_KEYS_PER_SOURCE)
    {
        return;
    }

    g_key_down[key_id] = 0U;
    g_key_filter_valid[key_id] = 0U;
    g_key_rt_armed[key_id] = 0U;
    g_key_raw_adc[key_id] = cfg->released_adc;
    g_key_filtered_adc[key_id] = cfg->released_adc;
    g_key_filtered_q8[key_id] = (uint32_t)cfg->released_adc << 8;
    g_key_position_pm[key_id] = 0U;
    g_key_peak_pm[key_id] = 0U;
    g_key_valley_pm[key_id] = 0U;
}

static uint8_t scan_cmd_id_is_supported(uint8_t cmd)
{
    switch (cmd)
    {
    case CH585_SCAN_CMD_GET_STATE:
    case CH585_SCAN_CMD_GET_DEBUG:
    case CH585_SCAN_CMD_GET_CONFIG:
    case CH585_SCAN_CMD_SET_CONFIG:
    case CH585_SCAN_CMD_CALIBRATE_KEY:
    case CH585_SCAN_CMD_CALIBRATE_ALL:
        return 1U;
    default:
        return 0U;
    }
}

static uint8_t key_config_set_u16(uint8_t key_id, uint8_t param_id, uint16_t value)
{
    ch585_key_config_t *cfg;

    if (key_id >= CH585_SCAN_KEYS_PER_SOURCE)
    {
        return 0U;
    }

    cfg = &g_key_config[key_id];

    switch (param_id)
    {
    case CH585_SCAN_CFG_RELEASED_ADC:
        cfg->released_adc = value;
        break;
    case CH585_SCAN_CFG_PRESSED_ADC:
        cfg->pressed_adc = value;
        break;
    case CH585_SCAN_CFG_MIN_ADC:
        cfg->min_adc = value;
        break;
    case CH585_SCAN_CFG_MAX_ADC:
        cfg->max_adc = value;
        break;
    case CH585_SCAN_CFG_PRESS_POSITION:
        cfg->press_position_pm = (value > 1000U) ? 1000U : value;
        break;
    case CH585_SCAN_CFG_RELEASE_POSITION:
        cfg->release_position_pm = (value > 1000U) ? 1000U : value;
        break;
    case CH585_SCAN_CFG_RT_PRESS_DELTA:
        cfg->rt_press_delta_pm = (value > 1000U) ? 1000U : value;
        break;
    case CH585_SCAN_CFG_RT_RELEASE_DELTA:
        cfg->rt_release_delta_pm = (value > 1000U) ? 1000U : value;
        break;
    case CH585_SCAN_CFG_FILTER_SHIFT:
        cfg->filter_shift = (value > 15U) ? 15U : (uint8_t)value;
        break;
    case CH585_SCAN_CFG_RT_ENABLE:
        cfg->rt_enable = (value != 0U) ? 1U : 0U;
        break;
    case CH585_SCAN_CFG_VALID:
        cfg->valid = (value != 0U) ? 1U : 0U;
        break;
    case CH585_SCAN_CFG_GLOBAL_KEY_ID:
        cfg->global_key_id = value;
        break;
    default:
        return 0U;
    }

    key_runtime_reset(key_id);
    return 1U;
}

static uint16_t scan_cmd_apply(const ch585_scan_wire_cmd_t *cmd)
{
    if (cmd == NULL)
    {
        return CH585_SCAN_FLAG_CMD_ERROR;
    }

    switch (cmd->cmd)
    {
    case CH585_SCAN_CMD_GET_STATE:
    case CH585_SCAN_CMD_GET_DEBUG:
    case CH585_SCAN_CMD_GET_CONFIG:
        return 0U;
    case CH585_SCAN_CMD_SET_CONFIG:
#if CH585_USE_SHORT_FRAME
        if (key_config_set_u16(cmd->target_key, cmd->param_id, cmd->value) == 0U)
        {
            return CH585_SCAN_FLAG_CMD_ERROR;
        }
        return 0U;
#else
        return CH585_SCAN_FLAG_CMD_ERROR;
#endif
    case CH585_SCAN_CMD_CALIBRATE_KEY:
#if CH585_USE_SHORT_FRAME
        if (cmd->target_key >= CH585_SCAN_KEYS_PER_SOURCE)
        {
            return CH585_SCAN_FLAG_CMD_ERROR;
        }
        key_runtime_reset(cmd->target_key);
        return 0U;
#else
        return CH585_SCAN_FLAG_CMD_ERROR;
#endif
    case CH585_SCAN_CMD_CALIBRATE_ALL:
        key_config_init_defaults();
        return 0U;
    default:
        return CH585_SCAN_FLAG_CMD_ERROR;
    }
}
#endif

static uint16_t sim_clamp_adc(int32_t value)
{
    if (value < 0)
    {
        return 0U;
    }

    if (value > 4095)
    {
        return 4095U;
    }

    return (uint16_t)value;
}

static uint16_t sim_key_position_pm(uint16_t seq, uint8_t key_id)
{
    uint16_t phase;

    if (key_id >= CH585_SIM_ACTIVE_KEYS)
    {
        return 0U;
    }

    phase = (uint16_t)((seq + ((uint16_t)key_id * 8U)) &
                       (CH585_SIM_PERIOD_FRAMES - 1U));

    if (phase < 8U)
    {
        return (uint16_t)((phase * 1000U) / 7U);
    }

    if (phase < 16U)
    {
        return 1000U;
    }

    if (phase < 24U)
    {
        return (uint16_t)(((23U - phase) * 1000U) / 7U);
    }

    return 0U;
}

static uint16_t sim_adc_value(uint16_t seq, uint8_t key_id)
{
    const ch585_key_config_t *cfg = key_config(key_id);
    uint16_t position_pm = sim_key_position_pm(seq, key_id);
    int32_t span = (int32_t)cfg->pressed_adc - (int32_t)cfg->released_adc;
    int16_t noise = (int16_t)(((seq * 17U) + ((uint16_t)key_id * 13U)) & 7U) - 3;
    int32_t value;

    if (cfg->valid == 0U)
    {
        return cfg->released_adc;
    }

    value = (int32_t)cfg->released_adc +
                    ((span * (int32_t)position_pm) / 1000) +
                    (int32_t)noise;

    return sim_clamp_adc(value);
}

static void key_state_set_bit(ch585_scan_wire_frame_t *frame, uint8_t key_id)
{
    frame->down_bits[key_id >> 3] |= (uint8_t)(1U << (key_id & 7U));
}

static uint16_t key_adc_to_position_pm(uint8_t key_id, uint16_t adc)
{
    const ch585_key_config_t *cfg = key_config(key_id);
    int32_t span = (int32_t)cfg->pressed_adc - (int32_t)cfg->released_adc;
    int32_t pos;

    if ((cfg->valid == 0U) || (span == 0))
    {
        return 0U;
    }

    pos = (((int32_t)adc - (int32_t)cfg->released_adc) * 1000) / span;
    if (pos < 0)
    {
        return 0U;
    }

    if (pos > 1000)
    {
        return 1000U;
    }

    return (uint16_t)pos;
}

