lixc929/hardware/firmware/ch585_spi_slave_test/src/main.c
static uint16_t key_filter_adc(uint8_t key_id, uint16_t adc)
{
    const ch585_key_config_t *cfg = key_config(key_id);
    uint32_t raw_q8 = (uint32_t)adc << 8;
    uint32_t filtered;
    uint8_t shift = cfg->filter_shift;

    if (shift > 15U)
    {
        shift = 15U;
    }

    if (g_key_filter_valid[key_id] == 0U)
    {
        g_key_filtered_q8[key_id] = raw_q8;
        g_key_filter_valid[key_id] = 1U;
    }
    else
    {
        filtered = g_key_filtered_q8[key_id];
        if (raw_q8 >= filtered)
        {
            filtered += (raw_q8 - filtered) >> shift;
        }
        else
        {
            filtered -= (filtered - raw_q8) >> shift;
        }
        g_key_filtered_q8[key_id] = filtered;
    }

    return (uint16_t)((g_key_filtered_q8[key_id] + 128U) >> 8);
}

static void key_press(uint8_t key_id, uint16_t position_pm)
{
    g_key_down[key_id] = 1U;
    g_key_rt_armed[key_id] = 0U;
    g_key_peak_pm[key_id] = position_pm;
    g_key_valley_pm[key_id] = position_pm;
}

static void key_release(uint8_t key_id, uint16_t position_pm, uint8_t rt_armed)
{
    g_key_down[key_id] = 0U;
    g_key_rt_armed[key_id] = rt_armed;
    g_key_peak_pm[key_id] = position_pm;
    g_key_valley_pm[key_id] = position_pm;
}

static void update_key_state_from_adc(uint8_t key_id, uint16_t adc)
{
    const ch585_key_config_t *cfg = key_config(key_id);
    uint16_t filtered_adc = key_filter_adc(key_id, adc);
    uint16_t position_pm = key_adc_to_position_pm(key_id, filtered_adc);

    if (cfg->valid == 0U)
    {
        g_key_down[key_id] = 0U;
        g_key_rt_armed[key_id] = 0U;
        g_key_raw_adc[key_id] = adc;
        g_key_filtered_adc[key_id] = filtered_adc;
        g_key_position_pm[key_id] = 0U;
        return;
    }

    g_key_raw_adc[key_id] = adc;
    g_key_filtered_adc[key_id] = filtered_adc;
    g_key_position_pm[key_id] = position_pm;

    if (g_key_down[key_id] == 0U)
    {
        if (position_pm < g_key_valley_pm[key_id])
        {
            g_key_valley_pm[key_id] = position_pm;
        }

#if CH585_KEY_ENABLE_RAPID_TRIGGER
        if ((cfg->rt_enable != 0U) &&
            (g_key_rt_armed[key_id] != 0U) &&
            (position_pm >=
             (uint16_t)(g_key_valley_pm[key_id] + cfg->rt_press_delta_pm)))
        {
            key_press(key_id, position_pm);
            return;
        }
#endif

        if (position_pm >= cfg->press_position_pm)
        {
            key_press(key_id, position_pm);
        }
    }
    else
    {
        if (position_pm > g_key_peak_pm[key_id])
        {
            g_key_peak_pm[key_id] = position_pm;
        }

#if CH585_KEY_ENABLE_RAPID_TRIGGER
        if ((cfg->rt_enable != 0U) &&
            ((position_pm + cfg->rt_release_delta_pm) <= g_key_peak_pm[key_id]))
        {
            key_release(key_id, position_pm, 1U);
            return;
        }
#endif

        if (position_pm <= cfg->release_position_pm)
        {
            key_release(key_id, position_pm, 0U);
        }
    }
}

static void update_all_key_states(uint16_t seq)
{
    uint8_t i;

    for (i = 0; i < CH585_SCAN_KEYS_PER_SOURCE; i++)
    {
        update_key_state_from_adc(i, sim_adc_value(seq, i));
    }
}

#if CH585_MODE_PIPELINE_SHORT || CH585_MODE_COMMAND_RESPONSE
static uint8_t scan_cmd_is_valid(const ch585_scan_wire_cmd_t *cmd)
{
    uint16_t expected_crc;

#if CH585_USE_SHORT_FRAME
    if (cmd->magic != CH585_SCAN_SHORT_CMD_MAGIC)
    {
        return 0U;
    }
    if (scan_cmd_id_is_supported(cmd->cmd) == 0U)
    {
        return 0U;
    }
#else
    if (cmd->magic != CH585_SCAN_CMD_MAGIC)
    {
        return 0U;
    }
    if (cmd->version != CH585_SCAN_FRAME_VERSION)
    {
        return 0U;
    }
    if (scan_cmd_id_is_supported(cmd->cmd) == 0U)
    {
        return 0U;
    }
#endif

    expected_crc = scan_crc16((const uint8_t *)cmd,
                              (uint16_t)offsetof(ch585_scan_wire_cmd_t, crc16));
    return (cmd->crc16 == expected_crc) ? 1U : 0U;
}
#endif

static void build_scan_frame_into(ch585_scan_wire_frame_t *frame,
                                  uint16_t seq,
                                  uint16_t flags,
                                  uint16_t ack_seq)
{
    uint8_t i;

    memset(frame, 0, sizeof(*frame));

#if CH585_USE_SHORT_FRAME
    (void)flags;
    frame->magic = CH585_SCAN_SHORT_FRAME_MAGIC;
    frame->type = CH585_SCAN_SHORT_FRAME_TYPE_KEY_STATE;
    frame->source_id = CH585_SCAN_SOURCE_ID;
    frame->seq = (uint8_t)seq;
    frame->flags = CH585_SCAN_SHORT_FLAG_READY;
    frame->ack_seq = (uint8_t)ack_seq;
#else
    frame->magic = CH585_SCAN_FRAME_MAGIC;
    frame->version = CH585_SCAN_FRAME_VERSION;
    frame->type = CH585_SCAN_FRAME_TYPE_KEY_STATE;
    frame->source_id = CH585_SCAN_SOURCE_ID;
    frame->key_count = CH585_SCAN_KEYS_PER_SOURCE;
    frame->seq = seq;
    frame->flags = flags;
    frame->ack_seq = ack_seq;
#endif

#if CH585_FAST_SIM_FRAME
    (void)i;
    frame->down_bits[0] = (uint8_t)(1U << ((seq >> 3U) & 7U));
    frame->down_bits[1] = (uint8_t)(1U << ((seq >> 4U) & 7U));
#else
    update_all_key_states(seq);
    for (i = 0; i < CH585_SCAN_KEYS_PER_SOURCE; i++)
    {
        if (g_key_down[i] != 0U)
        {
            key_state_set_bit(frame, i);
        }
    }
#endif

    frame->crc16 = scan_crc16((const uint8_t *)frame,
                              (uint16_t)offsetof(ch585_scan_wire_frame_t, crc16));
}

#if CH585_USE_SHORT_FRAME
static void build_debug_frame_into(ch585_scan_wire_frame_t *frame,
                                   uint16_t seq)
{
    ch585_scan_debug_short_t *debug = (ch585_scan_debug_short_t *)frame;
    uint8_t key_id;
    uint8_t debug_flags = CH585_SCAN_SHORT_FLAG_READY;

    memset(frame, 0, sizeof(*frame));
    update_all_key_states(seq);

#if CH585_DEBUG_FRAME_INTERVAL != 0
    key_id = (uint8_t)(((uint16_t)(seq / CH585_DEBUG_FRAME_INTERVAL)) %
                       CH585_SIM_ACTIVE_KEYS);
#else
    key_id = 0U;
#endif

    if (g_key_down[key_id] != 0U)
    {
        debug_flags |= CH585_SCAN_SHORT_DEBUG_FLAG_DOWN;
    }
    if (g_key_rt_armed[key_id] != 0U)
    {
        debug_flags |= CH585_SCAN_SHORT_DEBUG_FLAG_RT_ARMED;
    }

    debug->magic = CH585_SCAN_SHORT_FRAME_MAGIC;
    debug->type = CH585_SCAN_SHORT_FRAME_TYPE_KEY_DEBUG;
    debug->source_id = CH585_SCAN_SOURCE_ID;
    debug->seq = (uint8_t)seq;
    debug->key_id = key_id;
    debug->flags = debug_flags;
    debug->raw_adc = g_key_raw_adc[key_id];
    debug->filtered_adc = g_key_filtered_adc[key_id];
    debug->position_pm = g_key_position_pm[key_id];
    debug->peak_pm = g_key_peak_pm[key_id];
    debug->crc16 = scan_crc16((const uint8_t *)debug,
                              (uint16_t)offsetof(ch585_scan_debug_short_t, crc16));
}
#endif

