lixc929/hardware/firmware/ch585_spi_slave_test/src/main.c
static void build_scan_or_debug_frame_into(ch585_scan_wire_frame_t *frame,
                                           uint16_t seq,
                                           uint16_t flags,
                                           uint16_t ack_seq)
{
#if CH585_USE_SHORT_FRAME
#if CH585_DEBUG_FRAME_INTERVAL != 0
    if ((CH585_DEBUG_FRAME_INTERVAL != 0U) &&
        (seq != 0U) &&
        ((seq % CH585_DEBUG_FRAME_INTERVAL) == 0U))
    {
        (void)flags;
        (void)ack_seq;
        build_debug_frame_into(frame, seq);
        return;
    }
#endif
#endif

    build_scan_frame_into(frame, seq, flags, ack_seq);
}

#if CH585_MODE_PIPELINE_SHORT || CH585_MODE_COMMAND_RESPONSE
static void build_scan_frame(uint16_t seq, uint16_t flags, uint16_t ack_seq)
{
    build_scan_frame_into(&g_frame, seq, flags, ack_seq);
}
#endif

#if CH585_MODE_COMMAND_RESPONSE
static void finish_scan_frame(uint16_t flags, uint16_t ack_seq)
{
#if CH585_USE_SHORT_FRAME
    uint8_t short_flags = 0U;

    if ((flags & CH585_SCAN_FLAG_READY) != 0U)
    {
        short_flags |= CH585_SCAN_SHORT_FLAG_READY;
    }
    if ((flags & CH585_SCAN_FLAG_CMD_ERROR) != 0U)
    {
        short_flags |= CH585_SCAN_SHORT_FLAG_CMD_ERROR;
    }

    g_frame.flags = short_flags;
    g_frame.ack_seq = (uint8_t)ack_seq;
#else
    g_frame.flags = flags;
    g_frame.ack_seq = ack_seq;
#endif
    g_frame.crc16 = scan_crc16((const uint8_t *)&g_frame,
                               (uint16_t)offsetof(ch585_scan_wire_frame_t, crc16));
}
#endif

static void spi0_slave_stream_reset(void)
{
    R8_SPI0_CTRL_MOD = RB_SPI_ALL_CLEAR;
    R8_SPI0_CTRL_MOD = RB_SPI_MISO_OE | RB_SPI_MODE_SLAVE;
    R8_SPI0_CTRL_CFG |= RB_SPI_AUTO_IF;
    SPI0_DataMode(Mode0_HighBitINFront);
}

static void spi0_slave_pin_init(void)
{
#if CH585_SPI0_MISO_STRONG_DRIVE
    /*
     * One-CH585 high-speed experiment only: keep PA15/MISO on the strong
     * 20mA output driver. Do not use this unchanged on a shared MISO bus.
     */
    GPIOA_ModeCfg(GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14, GPIO_ModeIN_PU);
    GPIOA_ModeCfg(GPIO_Pin_15, GPIO_ModeOut_PP_20mA);
#else
    GPIOA_ModeCfg(GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15, GPIO_ModeIN_PU);
#endif
}

#if CH585_USE_SPI0_SLAVE_DMA
static void spi0_slave_dma_trans_arm(uint8_t *pbuf, uint16_t len)
{
    R8_SPI0_CTRL_MOD &= ~RB_SPI_FIFO_DIR;
    R32_SPI0_DMA_BEG = (uint32_t)pbuf;
    R32_SPI0_DMA_END = (uint32_t)(pbuf + len);
    R16_SPI0_TOTAL_CNT = len;
    R8_SPI0_INT_FLAG = RB_SPI_IF_CNT_END | RB_SPI_IF_DMA_END;
    R8_SPI0_CTRL_CFG |= RB_SPI_DMA_ENABLE;
}

#if CH585_MODE_COMMAND_RESPONSE
static void spi0_slave_dma_recv_arm(uint8_t *pbuf, uint16_t len)
{
    R8_SPI0_CTRL_MOD |= RB_SPI_FIFO_DIR;
    R32_SPI0_DMA_BEG = (uint32_t)pbuf;
    R32_SPI0_DMA_END = (uint32_t)(pbuf + len);
    R16_SPI0_TOTAL_CNT = len;
    R8_SPI0_INT_FLAG = RB_SPI_IF_CNT_END | RB_SPI_IF_DMA_END;
    R8_SPI0_CTRL_CFG |= RB_SPI_DMA_ENABLE;
}
#endif

static void spi0_slave_dma_wait_done(void)
{
    while ((R8_SPI0_INT_FLAG & RB_SPI_IF_CNT_END) == 0U)
    {
    }
    R8_SPI0_CTRL_CFG &= ~RB_SPI_DMA_ENABLE;
}
#endif

static void spi0_wait_cs_high(void)
{
    while ((R8_SPI0_RUN_FLAG & RB_SPI_SLV_SELECT) != 0U)
    {
    }
}

static void spi0_wait_cs_low(void)
{
    while ((R8_SPI0_RUN_FLAG & RB_SPI_SLV_SELECT) == 0U)
    {
    }
}

#if CH585_USE_PIPELINE_SHORT && CH585_USE_SHORT_FRAME
static void spi0_slave_pipeline_transrecv(uint8_t *tx, uint8_t *rx, uint16_t len)
{
    uint16_t txi = 0U;
    uint16_t rxi = 0U;

    memset(rx, 0, len);
    R8_SPI0_CTRL_MOD &= ~RB_SPI_FIFO_DIR;
    R16_SPI0_TOTAL_CNT = len;
    R8_SPI0_INT_FLAG = RB_SPI_IF_CNT_END | RB_SPI_IF_BYTE_END | RB_SPI_IF_FIFO_OV;

    SetFirstData(tx[0]);
    spi0_wait_cs_low();

    while ((rxi < len) || (txi < len))
    {
        while ((txi < len) && (R8_SPI0_FIFO_COUNT < SPI_FIFO_SIZE))
        {
            R8_SPI0_FIFO = tx[txi];
            txi++;
        }

        if ((R8_SPI0_INT_FLAG & RB_SPI_IF_BYTE_END) != 0U)
        {
            if (rxi < len)
            {
                rx[rxi] = R8_SPI0_BUFFER;
                rxi++;
            }
            R8_SPI0_INT_FLAG = RB_SPI_IF_BYTE_END;
        }

        if ((R8_SPI0_INT_FLAG & RB_SPI_IF_CNT_END) != 0U)
        {
            break;
        }
    }

    while ((R8_SPI0_INT_FLAG & RB_SPI_IF_CNT_END) == 0U)
    {
        if ((R8_SPI0_INT_FLAG & RB_SPI_IF_BYTE_END) != 0U)
        {
            if (rxi < len)
            {
                rx[rxi] = R8_SPI0_BUFFER;
                rxi++;
            }
            R8_SPI0_INT_FLAG = RB_SPI_IF_BYTE_END;
        }
    }

    R8_SPI0_INT_FLAG = RB_SPI_IF_CNT_END | RB_SPI_IF_BYTE_END | RB_SPI_IF_FIFO_OV;
}
#endif

int main(void)
{
#if CH585_LINK_TEST_MISO_LOW
    HSECFG_Capacitance(HSECap_18p);
    SetSysClock(SYSCLK_FREQ);

    /*
     * Physical-link test only: drive PA15/MISO low as a plain GPIO.
     * H417 should then read 0x00 on every sampled SPI byte if the wire,
     * power and common ground are correct.
     */
    GPIOA_ResetBits(GPIO_Pin_15);
    GPIOA_ModeCfg(GPIO_Pin_15, GPIO_ModeOut_PP_20mA);

    while (1)
    {
        GPIOA_ResetBits(GPIO_Pin_15);
    }
#elif CH585_LINK_TEST_SPI_PATTERN
    static uint8_t pattern[] = {
        0xA5U, 0x5AU, 0x3CU, 0xC3U,
        0x11U, 0x22U, 0x33U, 0x44U,
        0x55U, 0x66U, 0x77U, 0x88U,
        0x99U, 0xAAU, 0xBBU, 0xCCU,
    };

    HSECFG_Capacitance(HSECap_18p);
    SetSysClock(SYSCLK_FREQ);

    spi0_slave_pin_init();
    SPI0_SlaveInit();
    SPI0_DataMode(Mode0_HighBitINFront);
    SetFirstData(pattern[0]);

    while (1)
    {
        SPI0_SlaveTrans(pattern, (uint16_t)sizeof(pattern));
    }
#else
    uint16_t seq = 0U;
    uint16_t ack_host_seq = 0xFFFFU;
    uint16_t frame_flags;

    HSECFG_Capacitance(HSECap_18p);
    SetSysClock(SYSCLK_FREQ);
    key_config_init_defaults();

    spi0_slave_pin_init();
    SPI0_SlaveInit();
    SPI0_DataMode(Mode0_HighBitINFront);

#if CH585_USE_PIPELINE_SHORT && CH585_USE_SHORT_FRAME
    build_scan_frame(seq, CH585_SCAN_FLAG_READY, 0xFFFFU);
    while (1)
    {
        spi0_wait_cs_high();
        spi0_slave_stream_reset();
        spi0_slave_pipeline_transrecv((uint8_t *)&g_frame,
                                      g_pipe_rx,
                                      (uint16_t)sizeof(g_frame));
        spi0_wait_cs_high();

        memset(&g_cmd, 0, sizeof(g_cmd));
        memcpy(&g_cmd, g_pipe_rx, sizeof(g_cmd));

        if (scan_cmd_is_valid(&g_cmd) != 0U)
        {
            ack_host_seq = g_cmd.host_seq;
            seq++;
            frame_flags = (uint16_t)(CH585_SCAN_FLAG_READY | scan_cmd_apply(&g_cmd));
            build_scan_frame(seq, frame_flags, ack_host_seq);
        }
    }
#elif CH585_USE_REQUEST_ONLY_SHORT && CH585_USE_SHORT_FRAME
    uint8_t tx_index = 0U;

    (void)ack_host_seq;
    (void)frame_flags;
    build_scan_or_debug_frame_into(&g_frame_pingpong[0],
                                   seq,
                                   CH585_SCAN_FLAG_READY,
                                   0xFFFFU);
#if !CH585_STATIC_FRAME_TEST
    build_scan_or_debug_frame_into(&g_frame_pingpong[1],
                                   (uint16_t)(seq + 1U),
                                   CH585_SCAN_FLAG_READY,
                                   0xFFFFU);
#endif

    while (1)
    {
        ch585_scan_wire_frame_t *tx_frame = &g_frame_pingpong[tx_index];
        ch585_scan_wire_frame_t *next_frame = &g_frame_pingpong[tx_index ^ 1U];

