lixc929/hardware/firmware/ch585_spi_slave_test/src/main.c
        spi0_wait_cs_high();
        spi0_slave_stream_reset();
        SetFirstData(((uint8_t *)tx_frame)[0]);
#if CH585_USE_SPI0_SLAVE_DMA
        spi0_slave_dma_trans_arm((uint8_t *)tx_frame, (uint16_t)sizeof(*tx_frame));
        spi0_wait_cs_low();
#if !CH585_STATIC_FRAME_TEST
        build_scan_or_debug_frame_into(next_frame,
                                       (uint16_t)(seq + 1U),
                                       CH585_SCAN_FLAG_READY,
                                       0xFFFFU);
#endif
        spi0_slave_dma_wait_done();
#else
        spi0_wait_cs_low();
        SPI0_SlaveTrans((uint8_t *)tx_frame, (uint16_t)sizeof(*tx_frame));
#endif
        spi0_wait_cs_high();
#if !CH585_STATIC_FRAME_TEST
        seq++;
        tx_index ^= 1U;
#endif
    }
#else
    while (1)
    {
        spi0_wait_cs_high();

        /*
         * Prepare the key snapshot before the host command arrives. After a
         * valid command we only need to patch ack_seq and CRC, which keeps the
         * command-to-data turnaround short.
         */
        build_scan_frame(seq, CH585_SCAN_FLAG_READY, 0xFFFFU);

        memset(&g_cmd, 0, sizeof(g_cmd));
        spi0_slave_stream_reset();
#if CH585_USE_SPI0_SLAVE_DMA
        spi0_slave_dma_recv_arm((uint8_t *)&g_cmd, (uint16_t)sizeof(g_cmd));
        spi0_wait_cs_low();
        spi0_slave_dma_wait_done();
#else
        spi0_wait_cs_low();
        SPI0_SlaveRecv((uint8_t *)&g_cmd, (uint16_t)sizeof(g_cmd));
#endif
        spi0_wait_cs_high();

        frame_flags = CH585_SCAN_FLAG_READY;
        if (scan_cmd_is_valid(&g_cmd) != 0U)
        {
            ack_host_seq = g_cmd.host_seq;
            frame_flags |= scan_cmd_apply(&g_cmd);
        }
        else
        {
            continue;
        }

        finish_scan_frame(frame_flags, ack_host_seq);
        spi0_slave_stream_reset();
        SetFirstData(((uint8_t *)&g_frame)[0]);
#if CH585_USE_SPI0_SLAVE_DMA
        spi0_slave_dma_trans_arm((uint8_t *)&g_frame, (uint16_t)sizeof(g_frame));
        spi0_wait_cs_low();
        spi0_slave_dma_wait_done();
#else
        spi0_wait_cs_low();
        SPI0_SlaveTrans((uint8_t *)&g_frame, (uint16_t)sizeof(g_frame));
#endif
        seq++;
    }
#endif
#endif
}
